2D_Inviscid/Decelerating/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces1
{
    // Mandatory entries
    type            forces;
    libs            ("libforces.so");

    writeControl    runTime;
    writeInterval   1; //now every second


    patches         (upperairfoil && lowerairfoil);


    // Optional entries

    // Field names
    p               p;
    U               U;
    rho             rho;

    // Reference pressure [Pa]
    pRef            1;

    // Include porosity effects?
    porosity        no;

    // Store and write volume field representations of forces and moments
    writeFields     yes;

    // Centre of rotation for moment calculations
    CofR            (0 0 0);

    // Spatial data binning
    // - extents given by the bounds of the input geometry
    binData
    {
        nBin        20;
        direction   (1 0 0);
        cumulative  yes;
    }
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

